In [3]:
import numpy as np
import pandas as pd

In [4]:
from numpy.random import randn
np.random.seed(55)

In [5]:
dataframe = pd.DataFrame(randn(4,5),index=['P','Q','R','S'],columns=['A','B','C','D','E'])

In [6]:
dataframe.head()

          A         B         C         D         E
P -1.623731 -0.101784 -1.809791  0.262654  0.259953
Q -0.381086 -0.002290  0.341615  0.897572 -0.361100
R  1.656445 -1.189009  1.666429 -2.003439 -0.477873
S  1.368799  0.258169  0.702352  0.888382  0.722220

In [7]:
dataframe['A']

P   -1.623731
Q   -0.381086
R    1.656445
S    1.368799
Name: A, dtype: float64

In [8]:
dataframe[['A','B']]

          A         B
P -1.623731 -0.101784
Q -0.381086 -0.002290
R  1.656445 -1.189009
S  1.368799  0.258169

In [9]:
type(dataframe['A'])

pandas.core.series.Series

In [10]:
dataframe['F'] = dataframe['A'] + dataframe['B']

In [11]:
dataframe

          A         B         C         D         E         F
P -1.623731 -0.101784 -1.809791  0.262654  0.259953 -1.725515
Q -0.381086 -0.002290  0.341615  0.897572 -0.361100 -0.383376
R  1.656445 -1.189009  1.666429 -2.003439 -0.477873  0.467436
S  1.368799  0.258169  0.702352  0.888382  0.722220  1.626967

In [12]:
dataframe.loc['Q']

A   -0.381086
B   -0.002290
C    0.341615
D    0.897572
E   -0.361100
F   -0.383376
Name: Q, dtype: float64

In [13]:
dataframe.iloc[0]

A   -1.623731
B   -0.101784
C   -1.809791
D    0.262654
E    0.259953
F   -1.725515
Name: P, dtype: float64

In [14]:
dataframe.iloc[:]

          A         B         C         D         E         F
P -1.623731 -0.101784 -1.809791  0.262654  0.259953 -1.725515
Q -0.381086 -0.002290  0.341615  0.897572 -0.361100 -0.383376
R  1.656445 -1.189009  1.666429 -2.003439 -0.477873  0.467436
S  1.368799  0.258169  0.702352  0.888382  0.722220  1.626967

In [15]:
dataframe.iloc[:,:-1]

          A         B         C         D         E
P -1.623731 -0.101784 -1.809791  0.262654  0.259953
Q -0.381086 -0.002290  0.341615  0.897572 -0.361100
R  1.656445 -1.189009  1.666429 -2.003439 -0.477873
S  1.368799  0.258169  0.702352  0.888382  0.722220

In [16]:
dataframe.drop('F',axis=1)

          A         B         C         D         E
P -1.623731 -0.101784 -1.809791  0.262654  0.259953
Q -0.381086 -0.002290  0.341615  0.897572 -0.361100
R  1.656445 -1.189009  1.666429 -2.003439 -0.477873
S  1.368799  0.258169  0.702352  0.888382  0.722220

In [17]:
dataframe.iloc[:,:-1]

          A         B         C         D         E
P -1.623731 -0.101784 -1.809791  0.262654  0.259953
Q -0.381086 -0.002290  0.341615  0.897572 -0.361100
R  1.656445 -1.189009  1.666429 -2.003439 -0.477873
S  1.368799  0.258169  0.702352  0.888382  0.722220

In [18]:
dataframe.drop('F',axis=1,inplace=True)

In [19]:
dataframe.iloc[:,:-1]

          A         B         C         D
P -1.623731 -0.101784 -1.809791  0.262654
Q -0.381086 -0.002290  0.341615  0.897572
R  1.656445 -1.189009  1.666429 -2.003439
S  1.368799  0.258169  0.702352  0.888382

In [20]:
dataframe.iloc[:2,1:3]

          B         C
P -0.101784 -1.809791
Q -0.002290  0.341615

In [21]:
dataframe.drop('P',axis=0,inplace=True)

In [22]:
dataframe.iloc[:2,1:3]

          B         C
Q -0.002290  0.341615
R -1.189009  1.666429

In [23]:
dataframe

          A         B         C         D         E
Q -0.381086 -0.002290  0.341615  0.897572 -0.361100
R  1.656445 -1.189009  1.666429 -2.003439 -0.477873
S  1.368799  0.258169  0.702352  0.888382  0.722220

In [24]:
dataframe>0

       A      B     C      D      E
Q  False  False  True   True  False
R   True  False  True  False  False
S   True   True  True   True   True

In [25]:
dataframe[dataframe>0]

          A         B         C         D        E
Q       NaN       NaN  0.341615  0.897572      NaN
R  1.656445       NaN  1.666429       NaN      NaN
S  1.368799  0.258169  0.702352  0.888382  0.72222

In [26]:
dataframe[dataframe['A']>0]

          A         B         C         D         E
R  1.656445 -1.189009  1.666429 -2.003439 -0.477873
S  1.368799  0.258169  0.702352  0.888382  0.722220

In [27]:
dataframe[(dataframe['A']>0) & (dataframe['B'] > 0)]

          A         B         C         D        E
S  1.368799  0.258169  0.702352  0.888382  0.72222